app/controllers/matches_controller.rb

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 1)

  def index
    @matches = Match.paginate(:page => params[:page], :per_page => 15, :order => "created_at desc")
---
SELECT * FROM `matches` ORDER BY created_at desc

  def create
    @match = Match.new(params[:match])

    if @match.save
---
INSERT INTO `matches` (`k`, `created_at`, `away_score`, `updated_at`, `away`, `home`, `home_score`) VALUES(NULL, '2009-10-26 02:44:05', 18, '2009-10-26 02:44:05', '2', '1', 21)