app/controllers/users_controller.rb

  def create
    # Expire the homepage
    clear_caches

    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `rating`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('9450f811e6256708ad1264cb83124095ee72e1d0', 1500, '2009-10-25 22:29:32', NULL, 'c361e0f081eb4feb1d3d5d73945d5d5f9306b429', NULL, '2009-10-25 22:29:32', '121971838c2a76434b354d133dd1ced689f193fe', NULL, 'bill', 'bill@bil.com')